app/views/lists/show.html.erb

<h1><%= @list.name %></h1>
<% if not @list.items.empty? %>
---
SELECT  1 AS one FROM "items" INNER JOIN "items_lists" ON "items"."id" = "items_lists"."item_id" WHERE "items_lists"."list_id" = ? LIMIT 1  [["list_id", 38]]
SELECT "items".* FROM "items" INNER JOIN "items_lists" ON "items"."id" = "items_lists"."item_id" WHERE "items_lists"."list_id" = ?  [["list_id", 38]]