app/controllers/items_controller.rb

  def new
    @item = Item.new
    @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", nil]]

  def create
    @item = Item.new(params.require(:item).permit(:name))
    @list = List.find(params[:list_id])
    if @item.save
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "items" ("name", "price", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Beer"], ["price", 2.5], ["category", "Grocery"], ["created_at", "2017-04-10 16:25:36.747622"], ["updated_at", "2017-04-10 16:25:36.747622"]]