app/controllers/lists_controller.rb

  def create
    list = List.new(params.require(:list).permit(:name))
    if list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "dsds"], ["created_at", "2017-04-11 00:23:10.233823"], ["updated_at", "2017-04-11 00:23:10.233823"]]

  def show
    @list = List.find(params[:id])
    @items = Item.all
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 0]]
SELECT "items".* FROM "items"

  def view
    @lists = List.all
---
SELECT "lists".* FROM "lists"

  def destroy
    @list = List.find(params[:id])
    @list.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 8]]